In [6]:
import pandas as pd

clients = {
    'code': ['C11', 'C22', 'C33', 'C44'],
    'nom': ['Martin', 'Durand', 'Leboeuf', 'Carolin'],
    'age': [50, 40, 20, 35],
    'ville': ['Bordeaux', 'Pessac', 'Bordeaux', 'La Rochelle'],
    'cuisine_a_theme': ['y', 'n', 'n', 'y'],
    'livraison': ['y', 'y', 'n', 'n']
}

# Create DataFrame
df = pd.DataFrame(clients)
df

  code      nom  age        ville cuisine_a_theme livraison
0  C11   Martin   50     Bordeaux               y         y
1  C22   Durand   40       Pessac               n         y
2  C33  Leboeuf   20     Bordeaux               n         n
3  C44  Carolin   35  La Rochelle               y         n

In [8]:
# Get DataFrame size
df.shape

(4, 6)

In [7]:
# Get columns datatypes
df.dtypes

code               object
nom                object
age                 int64
ville              object
cuisine_a_theme    object
livraison          object
dtype: object

## Access cells value

3 primary indexers in pandas :
* **[]** : Primarily selects subsets of columns, but can select rows as well. Cannot simultaneously select rows and columns.
* **.loc** : selects subsets of rows and columns by label only 
* **.iloc** : selects subsets of rows and columns by integer location only

**pandas.DataFrame.at** : Access a single value for a row/column label pair.
Use at if you only need to get or set a single value in a DataFrame or Series.

In [11]:
# Select row (can be also done with .iloc, but this allows 
# selection by label)
df.loc[1]

code                  C22
nom                Durand
age                    40
ville              Pessac
cuisine_a_theme         n
livraison               y
Name: 1, dtype: object

In [12]:
# Select column
df['code']

0    C11
1    C22
2    C33
3    C44
Name: code, dtype: object

In [15]:
# Data can also be accessed like this, but using label
# allows the user to have columns with same labels keywordss
# other pandas keywords if needed
df.code

0    C11
1    C22
2    C33
3    C44
Name: code, dtype: object

In [13]:
# A subset of one column is named a Series in pandas
# and can be used with numpy for instance
type(df['code'])

pandas.core.series.Series

In [22]:
# As we can select rows/columns passing lists,
# we can also use list slicing

# Note that the last born is always included (pandas convention)

df.loc[0:2, 'code':'age']

  code      nom  age
0  C11   Martin   50
1  C22   Durand   40
2  C33  Leboeuf   20

In [25]:
# Access a single value for a row/column label pair.
# Use at if you only need to get or set a single value in
# a DataFrame or Series.

df.at[2, 'nom']

'Leboeuf'

In [28]:
# Get value within a Serie
df.loc[2].at['nom']

'Leboeuf'